---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NetworkValidityError
source: html/77269c9f-7557-2c9d-05d1-0c6ece00a54d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NetworkValidityError Property

The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkValidityError { get; }
```